test/fixtures/vcr_cassettes/get_event_properties.json

[
  {
    "request": {
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n    <SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://www.w3.org/2003/05/soap-envelope\"\n    xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\"\n    xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis=200401-wss-wssecurity-utility-1.0.xsd\">\n    <SOAP-ENV:Header><wsse:Security><wsse:UsernameToken>\n    <wsse:Username>admin</wsse:Username>\n    <wsse:Password Type=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest\">CKBrN7g46H8nVMr7JXOktext+lQ=</wsse:Password>\n    <wsse:Nonce>XMOFGMKsbMKtwofDrsKyw6NOSxEuFH/CnsKJW2Ex</wsse:Nonce>\n    <wsu:Created>2016-02-23T23:53:53Z</wsu:Created></wsse:UsernameToken>\n    </wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body>\n    <tev:GetEventProperties xmlns:tev=\"http://www.onvif.org/ver10/events/wsdl\"></tev:GetEventProperties>\n    </SOAP-ENV:Body></SOAP-ENV:Envelope>",
      "headers": {
        "Content-Type": "application/soap+xml",
        "SOAPAction": "http://www.w3.org/2003/05/soap-envelope"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "http://recorded_response/onvif/Events"
    },
    "response": {
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\r\n<env:Envelope xmlns:env=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:soapenc=\"http://www.w3.org/2003/05/soap-encoding\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xs=\"http://www.w3.org/2001/XMLSchema\" xmlns:tt=\"http://www.onvif.org/ver10/schema\" xmlns:tds=\"http://www.onvif.org/ver10/device/wsdl\" xmlns:trt=\"http://www.onvif.org/ver10/media/wsdl\" xmlns:timg=\"http://www.onvif.org/ver20/imaging/wsdl\" xmlns:tev=\"http://www.onvif.org/ver10/events/wsdl\" xmlns:tptz=\"http://www.onvif.org/ver20/ptz/wsdl\" xmlns:tan=\"http://www.onvif.org/ver20/analytics/wsdl\" xmlns:tst=\"http://www.onvif.org/ver10/storage/wsdl\" xmlns:ter=\"http://www.onvif.org/ver10/error\" xmlns:dn=\"http://www.onvif.org/ver10/network/wsdl\" xmlns:tns1=\"http://www.onvif.org/ver10/topics\" xmlns:tmd=\"http://www.onvif.org/ver10/deviceIO/wsdl\" xmlns:wsdl=\"http://schemas.xmlsoap.org/wsdl\" xmlns:wsoap12=\"http://schemas.xmlsoap.org/wsdl/soap12\" xmlns:http=\"http://schemas.xmlsoap.org/wsdl/http\" xmlns:d=\"http://schemas.xmlsoap.org/ws/2005/04/discovery\" xmlns:wsadis=\"http://schemas.xmlsoap.org/ws/2004/08/addressing\" xmlns:wsnt=\"http://docs.oasis-open.org/wsn/b-2\" xmlns:wsa=\"http://www.w3.org/2005/08/addressing\" xmlns:wstop=\"http://docs.oasis-open.org/wsn/t-1\" xmlns:wsrf-bf=\"http://docs.oasis-open.org/wsrf/bf-2\" xmlns:wsntw=\"http://docs.oasis-open.org/wsn/bw-2\" xmlns:wsrf-rw=\"http://docs.oasis-open.org/wsrf/rw-2\" xmlns:wsaw=\"http://www.w3.org/2006/05/addressing/wsdl\" xmlns:wsrf-r=\"http://docs.oasis-open.org/wsrf/r-2\" xmlns:trc=\"http://www.onvif.org/ver10/recording/wsdl\" xmlns:tse=\"http://www.onvif.org/ver10/search/wsdl\" xmlns:trp=\"http://www.onvif.org/ver10/replay/wsdl\" xmlns:tnshik=\"http://www.hikvision.com/2011/event/topics\" xmlns:hikwsd=\"http://www.onvifext.com/onvif/ext/ver10/wsdl\" xmlns:hikxsd=\"http://www.onvifext.com/onvif/ext/ver10/schema\"><env:Header><wsa:Action>http://www.onvif.org/ver10/events/wsdl/EventPortType/GetEventPropertiesResponse</wsa:Action>\r\n</env:Header>\r\n<env:Body><tev:GetEventPropertiesResponse><tev:TopicNamespaceLocation>http://www.onvif.org/onvif/ver10/topics/topicns.xml</tev:TopicNamespaceLocation>\r\n<wsnt:FixedTopicSet>true</wsnt:FixedTopicSet>\r\n<wstop:TopicSet><tns1:VideoSource wstop:topic=\"true\"><SignalLoss wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"true\"><tt:Source><tt:SimpleItemDescription Name=\"Source\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:SimpleItemDescription Name=\"State\" Type=\"xs:boolean\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</SignalLoss>\r\n<MotionAlarm wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"true\"><tt:Source><tt:SimpleItemDescription Name=\"Source\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:SimpleItemDescription Name=\"State\" Type=\"xs:boolean\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</MotionAlarm>\r\n</tns1:VideoSource>\r\n<tns1:Device wstop:topic=\"true\"><Trigger wstop:topic=\"true\"><tnshik:AlarmIn wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"true\"><tt:Source><tt:SimpleItemDescription Name=\"AlarmInToken\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:SimpleItemDescription Name=\"State\" Type=\"xs:boolean\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</tnshik:AlarmIn>\r\n<DigitalInput wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"true\"><tt:Source><tt:SimpleItemDescription Name=\"InputToken\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:SimpleItemDescription Name=\"LogicalState\" Type=\"xs:boolean\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</DigitalInput>\r\n<Relay wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"true\"><tt:Source><tt:SimpleItemDescription Name=\"RelayToken\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:SimpleItemDescription Name=\"LogicalState\" Type=\"tt:RelayLogicalState\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</Relay>\r\n</Trigger>\r\n<HardwareFailure wstop:topic=\"true\"><tnshik:HardDiskFull wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"HardDiskNo\" Type=\"xs:int\"/>\r\n</tt:Source>\r\n</tt:MessageDescription>\r\n</tnshik:HardDiskFull>\r\n<tnshik:HardDiskError wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"HardDiskNo\" Type=\"xs:int\"/>\r\n</tt:Source>\r\n</tt:MessageDescription>\r\n</tnshik:HardDiskError>\r\n</HardwareFailure>\r\n<tnshik:Network wstop:topic=\"true\"><tnshik:EthernetBroken wstop:topic=\"true\"/>\r\n<tnshik:IPAddrConflict wstop:topic=\"true\"/>\r\n</tnshik:Network>\r\n</tns1:Device>\r\n<tns1:UserAlarm wstop:topic=\"true\"><tnshik:IllegalAccess wstop:topic=\"true\"/>\r\n</tns1:UserAlarm>\r\n<tns1:RuleEngine wstop:topic=\"true\"><CellMotionDetector wstop:topic=\"true\"><Motion wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"true\"><tt:Source><tt:SimpleItemDescription Name=\"VideoSourceConfigurationToken\" Type=\"tt:ReferenceToken\"/>\r\n<tt:SimpleItemDescription Name=\"VideoAnalyticsConfigurationToken\" Type=\"tt:ReferenceToken\"/>\r\n<tt:SimpleItemDescription Name=\"Rule\" Type=\"xs:string\"/>\r\n</tt:Source>\r\n<tt:Data><tt:SimpleItemDescription Name=\"IsMotion\" Type=\"xs:boolean\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</Motion>\r\n</CellMotionDetector>\r\n<LineDetector wstop:topic=\"true\"><Crossed wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"true\"><tt:Source><tt:SimpleItemDescription Name=\"VideoSourceConfigurationToken\" Type=\"tt:ReferenceToken\"/>\r\n<tt:SimpleItemDescription Name=\"VideoAnalyticsConfigurationToken\" Type=\"tt:ReferenceToken\"/>\r\n<tt:SimpleItemDescription Name=\"Rule\" Type=\"xs:string\"/>\r\n</tt:Source>\r\n<tt:Data><tt:SimpleItemDescription Name=\"ObjectId\" Type=\"xs:integer\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</Crossed>\r\n</LineDetector>\r\n<FieldDetector wstop:topic=\"true\"><ObjectsInside wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"true\"><tt:Source><tt:SimpleItemDescription Name=\"VideoSourceConfigurationToken\" Type=\"tt:ReferenceToken\"/>\r\n<tt:SimpleItemDescription Name=\"VideoAnalyticsConfigurationToken\" Type=\"tt:ReferenceToken\"/>\r\n<tt:SimpleItemDescription Name=\"Rule\" Type=\"xs:string\"/>\r\n</tt:Source>\r\n<tt:Key><tt:SimpleItemDescription Name=\"ObjectId\" Type=\"xs:integer\"/>\r\n</tt:Key>\r\n<tt:Data><tt:SimpleItemDescription Name=\"IsInside\" Type=\"xs:boolean\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</ObjectsInside>\r\n</FieldDetector>\r\n<TamperDetector wstop:topic=\"true\"><Tamper wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"true\"><tt:Source><tt:SimpleItemDescription Name=\"VideoSourceConfigurationToken\" Type=\"tt:ReferenceToken\"/>\r\n<tt:SimpleItemDescription Name=\"VideoAnalyticsConfigurationToken\" Type=\"tt:ReferenceToken\"/>\r\n<tt:SimpleItemDescription Name=\"Rule\" Type=\"xs:string\"/>\r\n</tt:Source>\r\n<tt:Data><tt:SimpleItemDescription Name=\"IsTamper\" Type=\"xs:boolean\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</Tamper>\r\n</TamperDetector>\r\n</tns1:RuleEngine>\r\n<tns1:AudioAnalytics wstop:topic=\"true\"><Audio wstop:topic=\"true\"><DetectedSound wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"AudioSourceConfigurationToken\" Type=\"tt:ReferenceToken\"/>\r\n<tt:SimpleItemDescription Name=\"AudioAnalyticsConfigurationToken\" Type=\"tt:ReferenceToken\"/>\r\n<tt:SimpleItemDescription Name=\"Rule\" Type=\"xs:string\"/>\r\n</tt:Source>\r\n<tt:Key><tt:SimpleItemDescription Name=\"isSoundDetected\" Type=\"xs:boolean\"/>\r\n</tt:Key>\r\n<tt:Data><tt:SimpleItemDescription Name=\"UTCTime\" Type=\"xs:dateTime\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</DetectedSound>\r\n</Audio>\r\n</tns1:AudioAnalytics>\r\n<tns1:Configuration wstop:topic=\"true\"><Profile wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"Token\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:ElementItemDescription Name=\"Configuration\" Type=\"tt:Profile\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</Profile>\r\n<VideoEncoderConfiguration wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"Token\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:ElementItemDescription Name=\"Configuration\" Type=\"tt:VideoEncoderConfiguration\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</VideoEncoderConfiguration>\r\n<VideoSourceConfiguration wstop:topic=\"true\"><MediaService wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"Token\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:ElementItemDescription Name=\"Configuration\" Type=\"tt:VideoSourceConfiguration\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</MediaService>\r\n</VideoSourceConfiguration>\r\n<AudioEncoderConfiguration wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"Token\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:ElementItemDescription Name=\"Configuration\" Type=\"tt:AudioEncoderConfiguration\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</AudioEncoderConfiguration>\r\n<AudioSourceConfiguration wstop:topic=\"true\"><MediaService wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"Token\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:ElementItemDescription Name=\"Configuration\" Type=\"tt:AudioSourceConfiguration\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</MediaService>\r\n</AudioSourceConfiguration>\r\n<AudioOutputConfiguration wstop:topic=\"true\"><MediaService wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"Token\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:ElementItemDescription Name=\"Configuration\" Type=\"tt:AudioOutputConfiguration\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</MediaService>\r\n</AudioOutputConfiguration>\r\n<MetadataConfiguration wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"Token\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:ElementItemDescription Name=\"Configuration\" Type=\"tt:MetadataConfiguration\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</MetadataConfiguration>\r\n<PTZConfiguration wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"Token\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:ElementItemDescription Name=\"Configuration\" Type=\"tt:PTZConfiguration\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</PTZConfiguration>\r\n<VideoAnalyticsConfiguration wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"Token\" Type=\"tt:ReferenceToken\"/>\r\n</tt:Source>\r\n<tt:Data><tt:ElementItemDescription Name=\"Configuration\" Type=\"tt:VideoAnalyticsConfiguration\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</VideoAnalyticsConfiguration>\r\n</tns1:Configuration>\r\n<tns1:RecordingConfig wstop:topic=\"true\" xmlns:xs=\"http://www.w3.org/2001/XMLSchema\"><JobState wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"true\"><tt:Source><tt:SimpleItemDescription Name=\"RecordingJobToken\" Type=\"tt:RecordingJobReference\"/>\r\n</tt:Source>\r\n<tt:Data><tt:SimpleItemDescription Name=\"State\" Type=\"xs:string\"/>\r\n<tt:ElementItemDescription Name=\"Information\" Type=\"tt:RecordingJobStateInformation\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</JobState>\r\n<RecordingJobConfiguration wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"RecordingJobToken\" Type=\"tt:RecordingJobReference\"/>\r\n</tt:Source>\r\n<tt:Data><tt:ElementItemDescription Name=\"Configuration\" Type=\"tt:RecordingJobConfiguration\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</RecordingJobConfiguration>\r\n<RecordingConfiguration wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"RecordingToken\" Type=\"tt:RecordingReference\"/>\r\n</tt:Source>\r\n<tt:Data><tt:ElementItemDescription Name=\"Configuration\" Type=\"tt:RecordingConfiguration\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</RecordingConfiguration>\r\n<TrackConfiguration wstop:topic=\"true\"><tt:MessageDescription IsProperty=\"false\"><tt:Source><tt:SimpleItemDescription Name=\"RecordingToken\" Type=\"tt:RecordingReference\"/>\r\n<tt:SimpleItemDescription Name=\"TrackToken\" Type=\"tt:TrackReference\"/>\r\n</tt:Source>\r\n<tt:Data><tt:ElementItemDescription Name=\"Configuration\" Type=\"tt:TrackConfiguration\"/>\r\n</tt:Data>\r\n</tt:MessageDescription>\r\n</TrackConfiguration>\r\n</tns1:RecordingConfig>\r\n</wstop:TopicSet>\r\n<wsnt:TopicExpressionDialect>http://www.onvif.org/ver10/tev/topicExpression/ConcreteSet</wsnt:TopicExpressionDialect>\r\n<wsnt:TopicExpressionDialect>http://docs.oasis-open.org/wsn/t-1/TopicExpression/Concrete</wsnt:TopicExpressionDialect>\r\n<tev:MessageContentFilterDialect>http://www.onvif.org/ver10/tev/messageContentFilter/ItemFilter</tev:MessageContentFilterDialect>\r\n<tev:MessageContentSchemaLocation>http://www.onvif.org/onvif/ver10/schema/onvif.xsd</tev:MessageContentSchemaLocation>\r\n</tev:GetEventPropertiesResponse>\r\n</env:Body>\r\n</env:Envelope>\r\n",
      "headers": {
        "Date": "Tue, 23 Feb 2016 23:53:40 GMT",
        "Server": "App-webs/",
        "Connection": "close",
        "Content-Length": "12848",
        "Content-Type": "application/soap+xml; charset=utf-8"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
